//*************************************************  RGB NEOPIXEL   ****************************************************/
// Board has RGB LED 21
#define ENABLE_AMBIENTLIGHTING
#define HAS_NEOPIXEL                         // Enable the use of neopixels
#define NEOPIXEL_COUNT 1                     // How many neopixels are connected
#define NEOPIXEL_DATA 21                     // gpio pin used to send data to the neopixels
#define NEOPIXEL_TYPE (NEO_RGB + NEO_KHZ800) // type of neopixels in use
//************************************************  END LED  ***************************************************/


//*************************************************   OLED   ****************************************************/
// Дисплей OLED
// #define HAS_SCREEN 1
// #define USE_SH1106 1
#define USE_SSD1306
#define I2C_SCL 5
#define I2C_SDA 3
//***********************************************   END OLED  ***************************************************/


//*************************************************   I2C2   ****************************************************/
// Другий I2C для підключення зовнішніх пристроїв
//#define I2C_SDA1 42
//#define I2C_SCL1 41
//*************************************************  END I2C2  ***************************************************/

//*************************************************   GPS   ******************************************************/
/*
  No GPS - but free pins are available.
*/
//#define HAS_GPS 0
//#undef GPS_RX_PIN
//#undef GPS_TX_PIN
//*************************************************  END GPS  *****************************************************/


//*************************************************   BUTTON   ****************************************************/
// Пін кнопки
#define BUTTON_PIN 0   
#define BUTTON_NEED_PULLUP

//*************************************************  END BUTTON  ***************************************************/


//***************************************************   UART   *****************************************************/
// UART
#define UART_TX 43
#define UART_RX 44

//*************************************************   END UART   ****************************************************/



//***************************************************   FAN    ******************************************************/
//#define RF95_FAN_EN 17 // Пін для керування вентилятором якщо буде це потрібно. Теоретично достатньо радіатора,
                        // або навіть можна обійтись і без радіатора, якщо не буде суттєвого нагріву модема, бо 
                        // проєкт меш-мережі не передбачає високих навантажень на радіомодем
//*************************************************   END FAN   *****************************************************/



//*************************************************   SPI    ******************************************************/
//Піни, які приєднані до модема SX127x
#define LORA_CS 13
#define LORA_DIO1 10
#define LORA_RESET 12
#define LORA_DIO0 11
#define LORA_TXEN 2
#define LORA_RXEN 1

// Піни для SPI інтерфейсу радіомодема
#define LORA_MISO 9
#define LORA_MOSI 8
#define LORA_SCK 7


//Тип радіомодема
#define USE_RF95

//Піни для управління завданим радіомодемом
#define RF95_CS LORA_CS
#define RF95_IRQ LORA_DIO0
#define RF95_DIO1 LORA_DIO1
#define RF95_TXEN LORA_TXEN
#define RF95_RXEN LORA_RXEN
#define RF95_RESET LORA_RESET
#define RF95_MAX_POWER 20


//*************************************************  END SPI   *****************************************************/